package com.jack.test;

public class Test20231107 {
    // 1.地图上有三个地铁站，A 地铁站初始存放 30 辆小黄车，B 地铁站初始存放 40 辆小黄车，C 地铁站初始30
    //2、 有两辆货车持续在 A站、B 站和 C站之间运输，货车最大满载 20 辆小黄车。每秒能移动 3 个格子距离，路线随机;货车运输小黄车 (装卸时间不计)，确保三个地铁站小黄车足够满足乘客需求。
    // 3.每秒钟会有一个乘客会在 A、B、C 站之间使用小黄车骑行，路线随机，每秒只能骑行1个格子距离。

    //请模拟运行 200 秒钟，输出小黄车状态
    //编程要求:
    //1.使用面向对象的方法进行编程
    // 2.在编程时，可以使用多线程，也可以不使用多线程
    // 代码实现要考虑到扩展性。本题目扩展性仅限于考虑货车，小黄车移动速度，地图布局发生变化时

    //3.代码能够很容易地扩展和支持。
    //输出结果:
    public static void main(String[] args) {
        // 1.地图上有三个地铁站，A 地铁站初始存放 30 辆小黄车，B 地铁站初始存放 40 辆小黄车，C 地铁站初始30
        //2、 有两辆货车持续在 A站、B 站和 C站之间运输，货车最大满载 20 辆小黄车。每秒能移动 3 个格子距离，路线随机;货车运输小黄车 (装卸时间不计)，确保三个地铁站小黄车足够满足乘客需求。
        // 3.每秒钟会有一个乘客会在 A、B、C 站之间使用小黄车骑行，路线随机，每秒只能骑行1个格子距离。

        //请模拟运行 200 秒钟，输出小黄车状态
        //编程要求:
        //1.使用面向对象的方法进行编程
        // 2.在编程时，可以使用多线程，也可以不使用多线程
        // 代码实现要考虑到扩展性。本题目扩展性仅限于考虑货车，小黄车移动速度，地图布局发生变化时

        //3.代码能够很容易地扩展和支持。
        //输出结果:
    }
}
